public class Task_1 {
    public static void main(String[] args) {
        // 1.Зачем нужно ключевое слово this?
        // Указывает на область памяти текущего объекта

        // 2.Можно ли обратиться к полям класса, не используя ключевое слово this? Как?
        // да, просто по имени поля к полю и метода к методу.

        // 3.Когда стоит использовать слово this?
        //  В конструкторах класса, методе equals при работе внутри класса в местах где можно запутаться в именах полей.
    }
}
